{
  "pdf_path": "data/uploads/2508.16057v1.pdf",
  "title": "ThisistheAcceptedManuscriptversionofaconferencepaperpresentedat19thInternationalConferenceonComputational Urban Planning and Urban Management (CUPUM 2025) on Jun 24, 2025.",
  "sections": {
    "Full Text": "ThisistheAcceptedManuscriptversionofaconferencepaperpresentedat19thInternationalConferenceonComputational Urban Planning and Urban Management (CUPUM 2025) on Jun 24, 2025.\n\nCite as: Yang S, Lei B, Biljecki F (2025): Urban Comfort Assessment in the Era of Digital Planning: A Multidimensional, Data-driven, and AI-assisted Framework.\n\nIn: 19th International Conference on Computational Urban Planning and Urban Management (CUPUM 2025), London, UK.\n\nUrban Comfort Assessment in the Era of Digital Planning: A Multidimensional, Data-driven, and AI-assisted Framework Sijie Yang1,2, Binyu Lei1 and Filip Biljecki∗1,3 1Department of Architecture, National University of Singapore 2School of Engineering and Applied Science, University of Pennsylvania 3Department of Real Estate, National University of Singapore Summary Ensuring liveability and comfort is one of the fundamental objectives of urban planning.\n\nNumerous studies have employed computational methods to assess and quantify factors related to urban comfort such as greenery coverage, thermal comfort, and walkability.\n\nHowever, a clear definition of urban comfort and its comprehensive evaluation framework remain elusive.\n\nOur research explores the theoretical interpretations and methodologies for assessing urban comfort within digital planning, emphasising three key dimensions: multidimensional analysis, data support, and AI assistance.\n\nKEYWORDS: urban planning, street view imagery, streetscape, human-centred GeoAI, AI agent 1 The Multidimensional Nature of Urban Comfort Comfort is defined as the degree of satisfaction with the environment of a person (Frontczak et al., 2012; Shin, 2016).\n\nIn the built environment, there are many environmental factors that have been proven to be associated with human comfort sensation, including visual elements (Klemm et al., 2015; Liu et al., 2023; Yang et al., 2025), physiological data of individuals (Chwalek et al., 2024), occupant behaviour (Miller et al., 2025), meteorological indicators (Xie et al., 2019; Miller et al., 2023; Mosteiro-Romero et al., 2024), the design of public places (Santos Nouri et al., 2018), the dynamics of life quality (Lei et al., 2025) and so on.\n\nUrban comfort, in this context, refers specifically to the experience of comfort within the urban environment.\n\nIt is inherently a multidimensional concept due to the complexity and variability of the urban physical environment.\n\nUnlike general comfort, which can be defined at the individual level, urban comfort emerges as a collective and spatially embedded phenomenon, shaped by the interplay between environmental attributes and human perception.\n\nThe diverse components of the urban environment evoke a wide range of perceptions in individuals (Salesses et al., 2013; Dubey et al., 2016; Qiu et al., 2023; Yang et al., 2023; Ito et al., 2024), making it unsuitable for reduction into a single numerical index or one-dimensional measure, as it is often the case with other concepts in planning such as walkability.\n\nIn addition, ∗filip@nus.edu.sg guA ]IA.sc[ 1v75061.8052:viXra comfort is highly subjective, varying significantly from person to person based on their preferences, experiences, and expectations (Castaldo et al., 2018; Wang et al., 2018), which adds another layer of complexity to the understanding of urban comfort.\n\nFigure 1: Proposed multidimensional framework of urban comfort.\n\nBroadly, urban comfort can be categorised into two main dimensions: environmental comfort and social comfort, as described in Figure 1.\n\nEnvironmental comfort primarily refers to the perceptual and experiential satisfaction of people with the physical aspects of the built environment, such as thermal comfort (Rupp et al., 2015), visual comfort (Lam et al., 2020), and acoustic comfort (Yang and Kang, 2005).\n\nIn contrast, social comfort relates to how well the urban environment supports human interactions and behavioural needs.\n\nIt emphasizes the functional ability of spaces to facilitate desired user activities, such as walkability, accessibility, and safety.\n\nExamples include walkingcomfort(Maetal.,2021)andcyclingcomfort(Ayachietal.,2015), whichreflecthowurban infrastructure influences ease of movement and user experience.\n\nUrbancomfortisdeeplyintertwinedwiththecharacteristicsoftheurbanenvironment(Guly ́asetal., 2006).\n\nPeople experience different levels of comfort in heterogeneous urban settings (Kim et al., 2022), and even within the same environment, individuals may perceive comfort differently across various dimensions (Du et al., 2023).\n\nThis dual-layer relationship indicates that urban comfort is not only context-dependent but also multidimensional.\n\nInstead of considering urban comfort as a single scalar value, it is more accurate to conceptualise it as a vector U that captures the C multidimensional nature of urban comfort across several dimensions.\n\nMathematically, this can be expressed as U = [D ,D ,...,D ], where: C 1 2 n • D represents each dimension of urban comfort (e.g., thermal comfort, visual comfort). i • U is the vector of all the dimensions of comfort, reflecting the multidimensional aspects of C urban comfort without reducing them to a single aggregate value.\n\nOur vector-based approach acknowledges that different dimensions of urban comfort can interact witheachother,contributingdifferentlytotheperceptionofcomfortdependingontheurbancontext and individual preferences.\n\nThe complexity of assessing urban comfort lies in understanding how thesedimensionscoexistandinfluenceeachother, ratherthansimplyaggregatingthemintoasingle index.\n\nThis perspective reinforces the need for a comprehensive evaluation framework that captures the nuanced and multidimensional experiences of individuals within urban environments.\n\nInthisstudy, weclarifiedthemulti-dimensionalnatureofurbancomfortanditsmathexpressionby definition.\n\nIn the following sections, we further propose the four steps of urban comfort assessment and the role of AI algorithms in modelling urban comfort for digital planning, as shown in Figure Figure 2: Urban comfort assessment framework in this study. 2 Four-Step Framework for Data-Driven Urban Comfort Assessment To effectively evaluate urban comfort in its multidimensional attributes, we propose a structured, data-driven assessment framework encompassing four key steps: conducting comfort surveys, developing comfort models, scaling up urban comfort predictions, and performing regional validation, as illustrated in Figure 3.\n\nEach step is data-supported, leveraging three essential data streams: geospatial data to characterise the urban environment in the comfort survey, survey results to capture human comfort perception, and additional comfort survey data from distinct sites for model validation.\n\nAs shown in Figure 3, the process begins with a comfort survey conducted at a specified urban location, recording geospatial characteristics (X ...X ) and various comfort dimensions (D ...D ). 1 n 1 n Subsequently,thecollectedgeospatialandcomfortdataundergomodellingtocapturethenon-linear relationship between the urban environment and human comfort.\n\nThis model enables scaling up predictions to more urban areas across the city based on extended geospatial data, facilitating an Figure 3: Data-driven urban comfort assessment framework. urban-scale comfort assessment.\n\nFinally, the comfort model is validated using survey data from an additional, designated validation location. 3 AI-assisted Comfort Modelling in the Era of Digital Planning Data-driven, multidimensional urban comfort modelling can be further enhanced by artificial intelligence to support digital planning more effectively (Figure 4).\n\nAI models offer significant advantages, includinghigh-dimensionaldatarepresentation, non-linearrelationshipmodelling, scalability, generalisability, and spatial-temporal understanding, making them better suited than traditional methods for tackling the complexities of comfort modelling.\n\nFor instance, convolutional neural network (CNN) excels in feature extraction from image data and are widely used in processing satellite and street view imagery (SVI) as data representation tools.\n\nAdvanced AI models, such as deep neural network (DNN), demonstrate robust predictive performance with non-linear problems like human comfort and possess strong scalability and generalisation, enabling application to untrained data.\n\nComfort models developed for one urban area can be extended to predict comfort in other regions.\n\nAdditionally, long-short-term memory network (LSTM) is well-suited for time-series data, makingthemvaluableforhandlinglargevolumesoftemporally-labelledgeographicdataindynamic urban observations.\n\nThese AI technologies, when integrated, can significantly enhance comfort modelling and mapping within our data-supported urban comfort assessment framework, offering powerful tools for digital urban planning.\n\nAs depicted in Figure 4, typical applications include identifying areas with low comfortforprioritisationinurbanrenewal,highlightingcriticalurbanenvironmentalelementsneeding quality improvement, and conducting continuous geospatial analyses based on spatial-temporal Figure 4: AI-assisted comfort modelling features for digital planning. analytics to inform urban planning decisions (Yap et al., 2023; Liang et al., 2023; Yang et al., 2025). 4 Case Study: Thermal Comfort Analytics in Singapore Figure 5: Urban comfort assessment framework in the case study.\n\nToimplementourproposedfour-step, AI-assistedurbancomfortassessmentframework, weselected Singapore as the study area for a focused analysis of urban thermal comfort, given its strong emphasis on urban liveability and resilience in a high-density, tropical environment.\n\nAs illustrated in Figure 5, this case study adheres rigorously to the framework’s stages: conducting a comfort survey, developing comfort models, scaling up urban comfort predictions, and performing in-field validation.\n\nFigure 6: SVI-supported visual assessment as a replacement for in-field comfort survey.\n\nIn the comfort survey phase, we opted for a more efficient online approach using street view images instead of the traditional in-field survey combined with in-field validation, as shown in Figure 6.\n\nThis method leverages information embedded in street view images and utilises AI-based CNN feature extraction to replace in-field surveys that typically require extensive environmental measurements, participant involvement, and significant human and financial resources.\n\nNonetheless, for model validation, we still conducted a field comfort survey to confirm the model’s reliability.\n\nForcomfortmodelling,wedevelopedtwotypesofmodels: acomfortpredictionmodelandacomfort inference model (Figure 5).\n\nThe prediction model employs a DNN to achieve high accuracy and generalisation capabilities, enabling us to apply it to 92,233 street view images across Singapore to predict thermal comfort levels along urban streets.\n\nThe inference model, based on linear regression, interprets feature weights, allowing us to identify which factors significantly influence urban thermalcomfort.\n\nFinally, wemappedSingapore’surbanthermalcomfort(Figure7), clearlyidentifying spatial areas with higher and lower comfort levels.\n\nAs an addition, this mapping can provide valuable insights for urban planners to pinpoint zones requiring efforts to enhance street-level thermal comfort. 5 Contributions and Limitations This paper establishes a multidimensional framework for understanding urban comfort, introducing four key steps for assessing urban comfort.\n\nAdditionally, it examines the supportive role of AI in urban comfort modelling within the context of digital urban planning.\n\nIn the case study, we apply this framework to assess urban-scale thermal comfort in Singapore, utilising CNN, DNN, and other advanced technologies for thermal comfort modelling.\n\nThe resulting urban thermal comfort map of Singapore represents a valuable resource for digital urban planning efforts.\n\nHowever, this study has several limitations.\n\nFirst, considering the notion of data sources, we incorporate three key modelling methods in this framework to support the objective.\n\nHowever, this approach does not fully account for the diverse auxiliary roles that various AI technologies could play in urban comfort modelling, depending on specific use cases.\n\nFuture research could explore how different AI techniques-such as reinforcement learning, generative models, or multiagent systems-can further enhance urban comfort assessment and digital planning.\n\nSecond, the Figure 7: Comfort mapping for thermal comfort analytics in Singapore. case study focuses solely on thermal comfort as a one-dimensional aspect of urban comfort, without extendingtothemultidimensionalcomfortmodelproposedintheframework.\n\nFuturestudiesshould consider developing and validating a multidimensional comfort model to substantiate the reliability of this conceptual framework for urban comfort assessment.\n\nAcknowledgements We thank our colleagues at the NUS Urban Analytics Lab for the discussions.\n\nThis research is supported by NUS Research Scholarship (NUSGS-CDE DO IS AY22&L GRSUR0600042).\n\nThis research is part of the projects (1) Multi-scale Digital Twins for the Urban Environment: From HeartbeatstoCities,whichissupportedbytheSingaporeMinistryofEducationAcademicResearch Fund Tier 1; (2) Large-scale 3D Geospatial Data for Urban Analytics, which is supported by the National University of Singapore under the Start Up Grant R-295-000-171-133; (3) From Models to Pavements: Advancing Urban Digital Twins with a Multi-Dimensional Human-Centric Approach for a Smart Walkability Analysis, which is supported by the Humanities Social Sciences Seed Fund at the National University of Singapore (A-8001957-00-00).\n\nReferences Ayachi, F., Dorey, J., and Guastavino, C. (2015).\n\nIdentifying factors of bicycle comfort: An online survey with enthusiast cyclists.\n\nApplied ergonomics, 46:124-136.\n\nCastaldo, V.\n\nL., Pigliautile, I., Rosso, F., Cotana, F., De Giorgio, F., and Pisello, A.\n\nL. (2018).\n\nHow subjective and non-physical parameters affect occupants’ environmental comfort perception.\n\nEnergy and Buildings, 178:107-129.\n\nChwalek, P., Zhong, S., Perry, N., Liu, T., Miller, C., Alavi, H.\n\nS., Lalanne, D., and Paradiso, J.\n\nA. (2024).\n\nA dataset exploring urban comfort through novel wearables and environmental surveys.\n\nScientific data, 11(1):1423.\n\nDu, M., Hong, B., Gu, C., Li, Y., and Wang, Y. (2023).\n\nMultiple effects of visual-acoustic-thermal perceptions on the overall comfort of elderly adults in residential outdoor environments.\n\nEnergy and Buildings, 283:112813.\n\nDubey, A., Naik, N., Parikh, D., Raskar, R., and Hidalgo, C.\n\nA. (2016).\n\nDeep learning the city: Quantifying urban perception at a global scale.\n\nIn Computer Vision-ECCV 2016: 14th European Conference, Amsterdam, The Netherlands, October 11-14, 2016, Proceedings, Part I 14, pages 196-212.\n\nSpringer.\n\nFrontczak, M., Schiavon, S., Goins, J., Arens, E., Zhang, H., and Wargocki, P. (2012).\n\nQuantitative relationships between occupant satisfaction and satisfaction aspects of indoor environmental quality and building design.\n\nIndoor air, 22(2):119-131.\n\nGuly ́as, A ́., Unger, J., and Matzarakis, A. (2006).\n\nAssessment of the microclimatic and human comfort conditions in a complex urban environment: modelling and measurements.\n\nBuilding and Environment, 41(12):1713-1722.\n\nIto, K., Kang, Y., Zhang, Y., Zhang, F., and Biljecki, F. (2024).\n\nUnderstanding urban perception with visual data: A systematic review.\n\nCities, 152:105169.\n\nKim, Y., Yu, S., Li, D., Gatson, S.\n\nN., and Brown, R.\n\nD. (2022).\n\nLinking landscape spatial heterogeneity to urban heat island and outdoor human thermal comfort in tokyo: Application of the outdoor thermal comfort index.\n\nSustainable Cities and Society, 87:104262.\n\nKlemm, W., Heusinkveld, B.\n\nG., Lenzholzer, S., and van Hove, B. (2015).\n\nStreet greenery and its physicalandpsychologicalimpactonthermalcomfort.\n\nLandscape and urban planning, 138:87-98.\n\nLam, C.\n\nK.\n\nC., Yang, H., Yang, X., Liu, J., Ou, C., Cui, S., Kong, X., and Hang, J. (2020).\n\nCrossmodal effects of thermal and visual conditions on outdoor thermal and visual comfort perception.\n\nBuilding and Environment, 186:107297.\n\nLei, B., Liu, P., Liang, X., Yan, Y., and Biljecki, F. (2025).\n\nDeveloping the urban comfort index: Advancing liveability analytics with a multidimensional approach and explainable artificial intelligence.\n\nSustainable Cities and Society, page 106121.\n\nLiang, X., Zhao, T., and Biljecki, F. (2023).\n\nRevealing spatio-temporal evolution of urban visual environments with street view imagery.\n\nLandscape and Urban Planning, 237:104802.\n\nLiu, P., Zhao, T., Luo, J., Lei, B., Frei, M., Miller, C., and Biljecki, F. (2023).\n\nTowards humancentric digital twins: leveraging computer vision and graph models to predict outdoor comfort.\n\nSustainable Cities and Society, 93:104480.\n\nMa, X., Chau, C.\n\nK., and Lai, J.\n\nH.\n\nK. (2021).\n\nCritical factors influencing the comfort evaluation for recreational walking in urban street environments.\n\nCities, 116:103286.\n\nMiller, C., Chua, Y.\n\nX., Quintana, M., Lei, B., Biljecki, F., and Frei, M. (2025).\n\nMake yourself comfortable: Nudging urban heat and noise mitigation with smartwatch-based just-in-time adaptive interventions (jitai). arXiv preprint arXiv:2501.09530.\n\nMiller, C., Quintana, M., Frei, M., Chua, Y.\n\nX., Fu, C., Picchetti, B., Yap, W., Chong, A., and Biljecki, F. (2023).\n\nIntroducing the cool, quiet city competition: Predicting smartwatch-reported heatandnoisewithdigitaltwinmetrics.\n\nInProceedingsofthe10thACMInternationalConference on Systems for Energy-Efficient Buildings, Cities, and Transportation, pages 298-299.\n\nMosteiro-Romero, M., Park, Y., and Miller, C. (2024).\n\nPeople in cities: Combining subjective occupant feedback with urban-scale data to support indoor and outdoor thermal comfort.\n\nIn The 5th Asia Conference of International Building Performance Simulation Association 2024.\n\nQiu,W.,Li,W.,Liu,X.,Zhang,Z.,Li,X.,andHuang,X.(2023).\n\nSubjectiveandobjectivemeasures of streetscape perceptions: Relationships with property value in shanghai.\n\nCities, 132:104037.\n\nRupp, R.\n\nF., V ́asquez, N.\n\nG., and Lamberts, R. (2015).\n\nA review of human thermal comfort in the built environment.\n\nEnergy and buildings, 105:178-205.\n\nSalesses,P.,Schechtner,K.,andHidalgo,C.A.(2013).\n\nThecollaborativeimageofthecity: mapping the inequality of urban perception.\n\nPloS one, 8(7):e68400.\n\nSantos Nouri, A., Costa, J.\n\nP., Santamouris, M., and Matzarakis, A. (2018).\n\nApproaches to outdoor thermal comfort thresholds through public space design: A review.\n\nAtmosphere, 9(3):108.\n\nShin, J.-h. (2016).\n\nToward a theory of environmental satisfaction and human comfort: A processoriented and contextually sensitive theoretical framework.\n\nJournal of Environmental Psychology, 45:11-21.\n\nWang, J., Wang, Z., de Dear, R., Luo, M., Ghahramani, A., and Lin, B. (2018).\n\nThe uncertainty of subjective thermal comfort measurement.\n\nEnergy and Buildings, 181:38-49.\n\nXie, Y., Liu, J., Huang, T., Li, J., Niu, J., Mak, C.\n\nM., and Lee, T.-c. (2019).\n\nOutdoor thermal sensation and logistic regression analysis of comfort range of meteorological parameters in hong kong.\n\nBuilding and Environment, 155:175-186.\n\nYang, S., Chong, A., Liu, P., and Biljecki, F. (2025).\n\nThermal comfort in sight: Thermal affordance and its visual assessment for sustainable streetscape design.\n\nBuilding and Environment, page 112569.\n\nYang, S., Krenz, K., Qiu, W., and Li, W. (2023).\n\nThe role of subjective perceptions and objective measurements of the urban environment in explaining house prices in greater london: A multiscale urban morphology analysis.\n\nISPRS International Journal of Geo-Information, 12(6):249.\n\nYang, W. and Kang, J. (2005).\n\nAcoustic comfort evaluation in urban open public spaces.\n\nApplied acoustics, 66(2):211-229.\n\nYap, W., Chang, J.-H., and Biljecki, F. (2023).\n\nIncorporating networks in semantic understanding of streetscapes: Contextualising active mobility decisions.\n\nEnvironment and Planning B: Urban Analytics and City Science, 50(6):1416-1437.\n\nBiographies Sijie Yang is a PhD researcher at the NUS Urban Analytics Lab.\n\nHe holds a MSc in Space Syntax from University College London.\n\nHe is also a computer science master’s student at the School of Engineering and Applied Science, University of Pennsylvania.\n\nBinyu Lei is a PhD researcher at Urban Analytics Lab, Department of Architecture in the College of Design and Engineering at National University of Singapore.\n\nShe holds a Master degree in Urban Planning from the University of Melbourne.\n\nFilip Biljecki is an assistant professor at the National University of Singapore and the founder of the NUS Urban Analytics Lab.\n\nHe holds a MSc and PhD degree from the Delft University of Technology in the Netherlands."
  },
  "full_text": "ThisistheAcceptedManuscriptversionofaconferencepaperpresentedat19thInternationalConferenceonComputational Urban Planning and Urban Management (CUPUM 2025) on Jun 24, 2025.\n\nCite as: Yang S, Lei B, Biljecki F (2025): Urban Comfort Assessment in the Era of Digital Planning: A Multidimensional, Data-driven, and AI-assisted Framework.\n\nIn: 19th International Conference on Computational Urban Planning and Urban Management (CUPUM 2025), London, UK.\n\nUrban Comfort Assessment in the Era of Digital Planning: A Multidimensional, Data-driven, and AI-assisted Framework Sijie Yang1,2, Binyu Lei1 and Filip Biljecki∗1,3 1Department of Architecture, National University of Singapore 2School of Engineering and Applied Science, University of Pennsylvania 3Department of Real Estate, National University of Singapore Summary Ensuring liveability and comfort is one of the fundamental objectives of urban planning.\n\nNumerous studies have employed computational methods to assess and quantify factors related to urban comfort such as greenery coverage, thermal comfort, and walkability.\n\nHowever, a clear definition of urban comfort and its comprehensive evaluation framework remain elusive.\n\nOur research explores the theoretical interpretations and methodologies for assessing urban comfort within digital planning, emphasising three key dimensions: multidimensional analysis, data support, and AI assistance.\n\nKEYWORDS: urban planning, street view imagery, streetscape, human-centred GeoAI, AI agent 1 The Multidimensional Nature of Urban Comfort Comfort is defined as the degree of satisfaction with the environment of a person (Frontczak et al., 2012; Shin, 2016).\n\nIn the built environment, there are many environmental factors that have been proven to be associated with human comfort sensation, including visual elements (Klemm et al., 2015; Liu et al., 2023; Yang et al., 2025), physiological data of individuals (Chwalek et al., 2024), occupant behaviour (Miller et al., 2025), meteorological indicators (Xie et al., 2019; Miller et al., 2023; Mosteiro-Romero et al., 2024), the design of public places (Santos Nouri et al., 2018), the dynamics of life quality (Lei et al., 2025) and so on.\n\nUrban comfort, in this context, refers specifically to the experience of comfort within the urban environment.\n\nIt is inherently a multidimensional concept due to the complexity and variability of the urban physical environment.\n\nUnlike general comfort, which can be defined at the individual level, urban comfort emerges as a collective and spatially embedded phenomenon, shaped by the interplay between environmental attributes and human perception.\n\nThe diverse components of the urban environment evoke a wide range of perceptions in individuals (Salesses et al., 2013; Dubey et al., 2016; Qiu et al., 2023; Yang et al., 2023; Ito et al., 2024), making it unsuitable for reduction into a single numerical index or one-dimensional measure, as it is often the case with other concepts in planning such as walkability.\n\nIn addition, ∗filip@nus.edu.sg guA ]IA.sc[ 1v75061.8052:viXra comfort is highly subjective, varying significantly from person to person based on their preferences, experiences, and expectations (Castaldo et al., 2018; Wang et al., 2018), which adds another layer of complexity to the understanding of urban comfort.\n\nFigure 1: Proposed multidimensional framework of urban comfort.\n\nBroadly, urban comfort can be categorised into two main dimensions: environmental comfort and social comfort, as described in Figure 1.\n\nEnvironmental comfort primarily refers to the perceptual and experiential satisfaction of people with the physical aspects of the built environment, such as thermal comfort (Rupp et al., 2015), visual comfort (Lam et al., 2020), and acoustic comfort (Yang and Kang, 2005).\n\nIn contrast, social comfort relates to how well the urban environment supports human interactions and behavioural needs.\n\nIt emphasizes the functional ability of spaces to facilitate desired user activities, such as walkability, accessibility, and safety.\n\nExamples include walkingcomfort(Maetal.,2021)andcyclingcomfort(Ayachietal.,2015), whichreflecthowurban infrastructure influences ease of movement and user experience.\n\nUrbancomfortisdeeplyintertwinedwiththecharacteristicsoftheurbanenvironment(Guly ́asetal., 2006).\n\nPeople experience different levels of comfort in heterogeneous urban settings (Kim et al., 2022), and even within the same environment, individuals may perceive comfort differently across various dimensions (Du et al., 2023).\n\nThis dual-layer relationship indicates that urban comfort is not only context-dependent but also multidimensional.\n\nInstead of considering urban comfort as a single scalar value, it is more accurate to conceptualise it as a vector U that captures the C multidimensional nature of urban comfort across several dimensions.\n\nMathematically, this can be expressed as U = [D ,D ,...,D ], where: C 1 2 n • D represents each dimension of urban comfort (e.g., thermal comfort, visual comfort). i • U is the vector of all the dimensions of comfort, reflecting the multidimensional aspects of C urban comfort without reducing them to a single aggregate value.\n\nOur vector-based approach acknowledges that different dimensions of urban comfort can interact witheachother,contributingdifferentlytotheperceptionofcomfortdependingontheurbancontext and individual preferences.\n\nThe complexity of assessing urban comfort lies in understanding how thesedimensionscoexistandinfluenceeachother, ratherthansimplyaggregatingthemintoasingle index.\n\nThis perspective reinforces the need for a comprehensive evaluation framework that captures the nuanced and multidimensional experiences of individuals within urban environments.\n\nInthisstudy, weclarifiedthemulti-dimensionalnatureofurbancomfortanditsmathexpressionby definition.\n\nIn the following sections, we further propose the four steps of urban comfort assessment and the role of AI algorithms in modelling urban comfort for digital planning, as shown in Figure Figure 2: Urban comfort assessment framework in this study. 2 Four-Step Framework for Data-Driven Urban Comfort Assessment To effectively evaluate urban comfort in its multidimensional attributes, we propose a structured, data-driven assessment framework encompassing four key steps: conducting comfort surveys, developing comfort models, scaling up urban comfort predictions, and performing regional validation, as illustrated in Figure 3.\n\nEach step is data-supported, leveraging three essential data streams: geospatial data to characterise the urban environment in the comfort survey, survey results to capture human comfort perception, and additional comfort survey data from distinct sites for model validation.\n\nAs shown in Figure 3, the process begins with a comfort survey conducted at a specified urban location, recording geospatial characteristics (X ...X ) and various comfort dimensions (D ...D ). 1 n 1 n Subsequently,thecollectedgeospatialandcomfortdataundergomodellingtocapturethenon-linear relationship between the urban environment and human comfort.\n\nThis model enables scaling up predictions to more urban areas across the city based on extended geospatial data, facilitating an Figure 3: Data-driven urban comfort assessment framework. urban-scale comfort assessment.\n\nFinally, the comfort model is validated using survey data from an additional, designated validation location. 3 AI-assisted Comfort Modelling in the Era of Digital Planning Data-driven, multidimensional urban comfort modelling can be further enhanced by artificial intelligence to support digital planning more effectively (Figure 4).\n\nAI models offer significant advantages, includinghigh-dimensionaldatarepresentation, non-linearrelationshipmodelling, scalability, generalisability, and spatial-temporal understanding, making them better suited than traditional methods for tackling the complexities of comfort modelling.\n\nFor instance, convolutional neural network (CNN) excels in feature extraction from image data and are widely used in processing satellite and street view imagery (SVI) as data representation tools.\n\nAdvanced AI models, such as deep neural network (DNN), demonstrate robust predictive performance with non-linear problems like human comfort and possess strong scalability and generalisation, enabling application to untrained data.\n\nComfort models developed for one urban area can be extended to predict comfort in other regions.\n\nAdditionally, long-short-term memory network (LSTM) is well-suited for time-series data, makingthemvaluableforhandlinglargevolumesoftemporally-labelledgeographicdataindynamic urban observations.\n\nThese AI technologies, when integrated, can significantly enhance comfort modelling and mapping within our data-supported urban comfort assessment framework, offering powerful tools for digital urban planning.\n\nAs depicted in Figure 4, typical applications include identifying areas with low comfortforprioritisationinurbanrenewal,highlightingcriticalurbanenvironmentalelementsneeding quality improvement, and conducting continuous geospatial analyses based on spatial-temporal Figure 4: AI-assisted comfort modelling features for digital planning. analytics to inform urban planning decisions (Yap et al., 2023; Liang et al., 2023; Yang et al., 2025). 4 Case Study: Thermal Comfort Analytics in Singapore Figure 5: Urban comfort assessment framework in the case study.\n\nToimplementourproposedfour-step, AI-assistedurbancomfortassessmentframework, weselected Singapore as the study area for a focused analysis of urban thermal comfort, given its strong emphasis on urban liveability and resilience in a high-density, tropical environment.\n\nAs illustrated in Figure 5, this case study adheres rigorously to the framework’s stages: conducting a comfort survey, developing comfort models, scaling up urban comfort predictions, and performing in-field validation.\n\nFigure 6: SVI-supported visual assessment as a replacement for in-field comfort survey.\n\nIn the comfort survey phase, we opted for a more efficient online approach using street view images instead of the traditional in-field survey combined with in-field validation, as shown in Figure 6.\n\nThis method leverages information embedded in street view images and utilises AI-based CNN feature extraction to replace in-field surveys that typically require extensive environmental measurements, participant involvement, and significant human and financial resources.\n\nNonetheless, for model validation, we still conducted a field comfort survey to confirm the model’s reliability.\n\nForcomfortmodelling,wedevelopedtwotypesofmodels: acomfortpredictionmodelandacomfort inference model (Figure 5).\n\nThe prediction model employs a DNN to achieve high accuracy and generalisation capabilities, enabling us to apply it to 92,233 street view images across Singapore to predict thermal comfort levels along urban streets.\n\nThe inference model, based on linear regression, interprets feature weights, allowing us to identify which factors significantly influence urban thermalcomfort.\n\nFinally, wemappedSingapore’surbanthermalcomfort(Figure7), clearlyidentifying spatial areas with higher and lower comfort levels.\n\nAs an addition, this mapping can provide valuable insights for urban planners to pinpoint zones requiring efforts to enhance street-level thermal comfort. 5 Contributions and Limitations This paper establishes a multidimensional framework for understanding urban comfort, introducing four key steps for assessing urban comfort.\n\nAdditionally, it examines the supportive role of AI in urban comfort modelling within the context of digital urban planning.\n\nIn the case study, we apply this framework to assess urban-scale thermal comfort in Singapore, utilising CNN, DNN, and other advanced technologies for thermal comfort modelling.\n\nThe resulting urban thermal comfort map of Singapore represents a valuable resource for digital urban planning efforts.\n\nHowever, this study has several limitations.\n\nFirst, considering the notion of data sources, we incorporate three key modelling methods in this framework to support the objective.\n\nHowever, this approach does not fully account for the diverse auxiliary roles that various AI technologies could play in urban comfort modelling, depending on specific use cases.\n\nFuture research could explore how different AI techniques-such as reinforcement learning, generative models, or multiagent systems-can further enhance urban comfort assessment and digital planning.\n\nSecond, the Figure 7: Comfort mapping for thermal comfort analytics in Singapore. case study focuses solely on thermal comfort as a one-dimensional aspect of urban comfort, without extendingtothemultidimensionalcomfortmodelproposedintheframework.\n\nFuturestudiesshould consider developing and validating a multidimensional comfort model to substantiate the reliability of this conceptual framework for urban comfort assessment.\n\nAcknowledgements We thank our colleagues at the NUS Urban Analytics Lab for the discussions.\n\nThis research is supported by NUS Research Scholarship (NUSGS-CDE DO IS AY22&L GRSUR0600042).\n\nThis research is part of the projects (1) Multi-scale Digital Twins for the Urban Environment: From HeartbeatstoCities,whichissupportedbytheSingaporeMinistryofEducationAcademicResearch Fund Tier 1; (2) Large-scale 3D Geospatial Data for Urban Analytics, which is supported by the National University of Singapore under the Start Up Grant R-295-000-171-133; (3) From Models to Pavements: Advancing Urban Digital Twins with a Multi-Dimensional Human-Centric Approach for a Smart Walkability Analysis, which is supported by the Humanities Social Sciences Seed Fund at the National University of Singapore (A-8001957-00-00).\n\nReferences Ayachi, F., Dorey, J., and Guastavino, C. (2015).\n\nIdentifying factors of bicycle comfort: An online survey with enthusiast cyclists.\n\nApplied ergonomics, 46:124-136.\n\nCastaldo, V.\n\nL., Pigliautile, I., Rosso, F., Cotana, F., De Giorgio, F., and Pisello, A.\n\nL. (2018).\n\nHow subjective and non-physical parameters affect occupants’ environmental comfort perception.\n\nEnergy and Buildings, 178:107-129.\n\nChwalek, P., Zhong, S., Perry, N., Liu, T., Miller, C., Alavi, H.\n\nS., Lalanne, D., and Paradiso, J.\n\nA. (2024).\n\nA dataset exploring urban comfort through novel wearables and environmental surveys.\n\nScientific data, 11(1):1423.\n\nDu, M., Hong, B., Gu, C., Li, Y., and Wang, Y. (2023).\n\nMultiple effects of visual-acoustic-thermal perceptions on the overall comfort of elderly adults in residential outdoor environments.\n\nEnergy and Buildings, 283:112813.\n\nDubey, A., Naik, N., Parikh, D., Raskar, R., and Hidalgo, C.\n\nA. (2016).\n\nDeep learning the city: Quantifying urban perception at a global scale.\n\nIn Computer Vision-ECCV 2016: 14th European Conference, Amsterdam, The Netherlands, October 11-14, 2016, Proceedings, Part I 14, pages 196-212.\n\nSpringer.\n\nFrontczak, M., Schiavon, S., Goins, J., Arens, E., Zhang, H., and Wargocki, P. (2012).\n\nQuantitative relationships between occupant satisfaction and satisfaction aspects of indoor environmental quality and building design.\n\nIndoor air, 22(2):119-131.\n\nGuly ́as, A ́., Unger, J., and Matzarakis, A. (2006).\n\nAssessment of the microclimatic and human comfort conditions in a complex urban environment: modelling and measurements.\n\nBuilding and Environment, 41(12):1713-1722.\n\nIto, K., Kang, Y., Zhang, Y., Zhang, F., and Biljecki, F. (2024).\n\nUnderstanding urban perception with visual data: A systematic review.\n\nCities, 152:105169.\n\nKim, Y., Yu, S., Li, D., Gatson, S.\n\nN., and Brown, R.\n\nD. (2022).\n\nLinking landscape spatial heterogeneity to urban heat island and outdoor human thermal comfort in tokyo: Application of the outdoor thermal comfort index.\n\nSustainable Cities and Society, 87:104262.\n\nKlemm, W., Heusinkveld, B.\n\nG., Lenzholzer, S., and van Hove, B. (2015).\n\nStreet greenery and its physicalandpsychologicalimpactonthermalcomfort.\n\nLandscape and urban planning, 138:87-98.\n\nLam, C.\n\nK.\n\nC., Yang, H., Yang, X., Liu, J., Ou, C., Cui, S., Kong, X., and Hang, J. (2020).\n\nCrossmodal effects of thermal and visual conditions on outdoor thermal and visual comfort perception.\n\nBuilding and Environment, 186:107297.\n\nLei, B., Liu, P., Liang, X., Yan, Y., and Biljecki, F. (2025).\n\nDeveloping the urban comfort index: Advancing liveability analytics with a multidimensional approach and explainable artificial intelligence.\n\nSustainable Cities and Society, page 106121.\n\nLiang, X., Zhao, T., and Biljecki, F. (2023).\n\nRevealing spatio-temporal evolution of urban visual environments with street view imagery.\n\nLandscape and Urban Planning, 237:104802.\n\nLiu, P., Zhao, T., Luo, J., Lei, B., Frei, M., Miller, C., and Biljecki, F. (2023).\n\nTowards humancentric digital twins: leveraging computer vision and graph models to predict outdoor comfort.\n\nSustainable Cities and Society, 93:104480.\n\nMa, X., Chau, C.\n\nK., and Lai, J.\n\nH.\n\nK. (2021).\n\nCritical factors influencing the comfort evaluation for recreational walking in urban street environments.\n\nCities, 116:103286.\n\nMiller, C., Chua, Y.\n\nX., Quintana, M., Lei, B., Biljecki, F., and Frei, M. (2025).\n\nMake yourself comfortable: Nudging urban heat and noise mitigation with smartwatch-based just-in-time adaptive interventions (jitai). arXiv preprint arXiv:2501.09530.\n\nMiller, C., Quintana, M., Frei, M., Chua, Y.\n\nX., Fu, C., Picchetti, B., Yap, W., Chong, A., and Biljecki, F. (2023).\n\nIntroducing the cool, quiet city competition: Predicting smartwatch-reported heatandnoisewithdigitaltwinmetrics.\n\nInProceedingsofthe10thACMInternationalConference on Systems for Energy-Efficient Buildings, Cities, and Transportation, pages 298-299.\n\nMosteiro-Romero, M., Park, Y., and Miller, C. (2024).\n\nPeople in cities: Combining subjective occupant feedback with urban-scale data to support indoor and outdoor thermal comfort.\n\nIn The 5th Asia Conference of International Building Performance Simulation Association 2024.\n\nQiu,W.,Li,W.,Liu,X.,Zhang,Z.,Li,X.,andHuang,X.(2023).\n\nSubjectiveandobjectivemeasures of streetscape perceptions: Relationships with property value in shanghai.\n\nCities, 132:104037.\n\nRupp, R.\n\nF., V ́asquez, N.\n\nG., and Lamberts, R. (2015).\n\nA review of human thermal comfort in the built environment.\n\nEnergy and buildings, 105:178-205.\n\nSalesses,P.,Schechtner,K.,andHidalgo,C.A.(2013).\n\nThecollaborativeimageofthecity: mapping the inequality of urban perception.\n\nPloS one, 8(7):e68400.\n\nSantos Nouri, A., Costa, J.\n\nP., Santamouris, M., and Matzarakis, A. (2018).\n\nApproaches to outdoor thermal comfort thresholds through public space design: A review.\n\nAtmosphere, 9(3):108.\n\nShin, J.-h. (2016).\n\nToward a theory of environmental satisfaction and human comfort: A processoriented and contextually sensitive theoretical framework.\n\nJournal of Environmental Psychology, 45:11-21.\n\nWang, J., Wang, Z., de Dear, R., Luo, M., Ghahramani, A., and Lin, B. (2018).\n\nThe uncertainty of subjective thermal comfort measurement.\n\nEnergy and Buildings, 181:38-49.\n\nXie, Y., Liu, J., Huang, T., Li, J., Niu, J., Mak, C.\n\nM., and Lee, T.-c. (2019).\n\nOutdoor thermal sensation and logistic regression analysis of comfort range of meteorological parameters in hong kong.\n\nBuilding and Environment, 155:175-186.\n\nYang, S., Chong, A., Liu, P., and Biljecki, F. (2025).\n\nThermal comfort in sight: Thermal affordance and its visual assessment for sustainable streetscape design.\n\nBuilding and Environment, page 112569.\n\nYang, S., Krenz, K., Qiu, W., and Li, W. (2023).\n\nThe role of subjective perceptions and objective measurements of the urban environment in explaining house prices in greater london: A multiscale urban morphology analysis.\n\nISPRS International Journal of Geo-Information, 12(6):249.\n\nYang, W. and Kang, J. (2005).\n\nAcoustic comfort evaluation in urban open public spaces.\n\nApplied acoustics, 66(2):211-229.\n\nYap, W., Chang, J.-H., and Biljecki, F. (2023).\n\nIncorporating networks in semantic understanding of streetscapes: Contextualising active mobility decisions.\n\nEnvironment and Planning B: Urban Analytics and City Science, 50(6):1416-1437.\n\nBiographies Sijie Yang is a PhD researcher at the NUS Urban Analytics Lab.\n\nHe holds a MSc in Space Syntax from University College London.\n\nHe is also a computer science master’s student at the School of Engineering and Applied Science, University of Pennsylvania.\n\nBinyu Lei is a PhD researcher at Urban Analytics Lab, Department of Architecture in the College of Design and Engineering at National University of Singapore.\n\nShe holds a Master degree in Urban Planning from the University of Melbourne.\n\nFilip Biljecki is an assistant professor at the National University of Singapore and the founder of the NUS Urban Analytics Lab.\n\nHe holds a MSc and PhD degree from the Delft University of Technology in the Netherlands.",
  "metadata": {
    "filename": "2508.16057v1.pdf",
    "file_size_mb": 4.21,
    "num_sections": 1,
    "text_length": 20931,
    "word_count": 2765,
    "processing_status": "success"
  }
}